docs(build): added rough draft for documentation
